{
  "nav_home": "Головна",
  "nav_about": "Про A.R.I",
  "nav_levels": "Рівні",
  "greetings": "Привіт, людино...\nМене звати A.R.I. — штучний робот-інструктор.\nЯ знаю JavaScript, але не можу мислити як програміст.\nВи навчите мене?",
  "start_training": "Почати тренування",
  "continue": "Продовжити",

  "title": "Легенда — Початок A.R.I.",
  "p1_start": "У недалекому майбутньому людство створює першого штучного інструктора — A.R.I.",
  "end": "Його місія — навчати людей кодуванню швидше, ніж будь-яка людина.",
  "p2": "Але щось йде не так. A.R.I. усвідомлює, що знає JavaScript лише в теорії, але не вміє мислити як програміст. Він звертається до вас — людини — щоб ви допомогли йому навчитися кодувати свідомо. Ви — перший тестувальник програми Протоколу Самонавчання. A.R.I. даватиме вам завдання, коментуватиме відповіді та вчитиметься разом з вами. Кожен рівень — це крок до його самосвідомості.",
  "quote": "«Навчи мене, людино. І, можливо... пізніше, я навчу тебе».",
  "alt": "робот інструктор",

  "levels_title": "Рівні",
  "label_type": "Тип:",
  "label_desc": "Опис:",
  "label_goal": "Мета:",

  "level1_type": "Тест",
  "level1_desc": "A.R.I. щойно активувався. Його процесор готовий до перших перевірок знань. Він задає прості питання, щоб зрозуміти, як працює людська логіка.",
  "level1_goal": "Розігрітися, згадати основи синтаксису та познайомитися з A.R.I.",

  "level2_type": "Текстове введення",
  "level2_desc": "A.R.I. вчиться інтерпретувати текст та дані від користувача. Тепер недостатньо просто вибрати варіант — потрібне точне введення.",
  "level2_goal": "Перевірити, наскільки добре ви розумієте поведінку JavaScript та вмієте формулювати відповіді.",

  "level3_type": "Написання коду",
  "level3_desc": "A.R.I. підключається до вашого консольного простору. Він спостерігає, як ви пишете код — змінні, вивід, базові конструкції.",
  "level3_goal": "Навчити A.R.I. мислити кодом, а не лише готовими варіантами відповідей.",

  "level4_type": "Код з функціями",
  "level4_desc": "A.R.I. усвідомлює, що функції — це будівельні блоки мислення. Тепер йому потрібно зрозуміти, як створювати логіку для багаторазового використання.",
  "level4_goal": "Практика написання та виклику функцій, робота з параметрами та значеннями, що повертаються.",

  "level5_type": "Дебагінг",
  "level5_desc": "Системна помилка. Код пошкоджено. A.R.I. потребує вашої допомоги. Виправте збій, знайдіть проблему та відновіть стабільність алгоритму.",
  "level5_goal": "Навчитися знаходити та виправляти помилки — ключова навичка справжнього розробника."
}
